import React from "react";

const NoCodeMessage = () => {
    return (
        <div className="faq_block">
            <div className="faq_block__title">
                <span>
                    Не приходит код подтверждения или другие уведомления?
                </span>
            </div>
            <div className="faq_block__desk">
                <p>
                    Вы можете зайти в свою учетную запись используя следующие
                    методы для входа в систему:{" "}
                </p>
                <span>Войти по логину и паролю</span>
                <ul>
                    <li>
                        (1) Войдите в приложение Bitget или осуществите вход
                        через веб-сайт
                    </li>
                    <li>(2) Нажмите "Войти"</li>
                    <li>
                        (3) Введите ваш логин и пароль (номер мобильного
                        телефона или адрес электронной почты)
                    </li>
                    <li>
                        (4) Получите код подтверждения через Google
                        Authenticator / смс / электронную почту
                    </li>
                    <li>(5) Нажмите "Войти"</li>
                    <li>
                        (6) Если код подтверждения не пришел, попробуйте еще раз
                        или обратитесь за помощью в онлайн-службу поддержки
                    </li>
                </ul>
                <span>Вход через сканирование QR-кода </span>
                <ul>
                    <li>
                        (1) Зайдите на страницу входа (доступно для веб-версии и
                        десктопного приложения)
                    </li>
                    <li>(2) Выберете в окне для входа "QR-код"</li>
                    <li>
                        (3) Откройте ваше приложение Bitget (вы должны быть там
                        авторизированы), кликнете на главной странице в правом
                        верхнем углу значек сканирования.
                    </li>
                    <li>(4) Отсканируйте QR-код на вашем ПК </li>
                </ul>
                <span>Вход через сканирование QR-кода </span>
                <ul>
                    <li>
                        (1) Зайдите на страницу входа (доступно для веб-версии и
                        десктопного приложения)
                    </li>
                    <li>(2) Выберете в окне для входа "QR-код"</li>
                    <li>
                        (3) Откройте ваше приложение Bitget (вы должны быть там
                        авторизированы), кликнете на главной странице в правом
                        верхнем углу значек сканирования.
                    </li>
                    <li>(4) Отсканируйте QR-код на вашем ПК </li>
                </ul>
                <span>Вход через сканирование QR-кода </span>
                <ul>
                    <li>
                        (1) Зайдите на страницу входа (доступно для веб-версии и
                        десктопного приложения)
                    </li>
                    <li>(2) Выберете в окне для входа "QR-код"</li>
                    <li>
                        (3) Откройте ваше приложение Bitget (вы должны быть там
                        авторизированы), кликнете на главной странице в правом
                        верхнем углу значек сканирования.
                    </li>
                    <li>(4) Отсканируйте QR-код на вашем ПК </li>
                </ul>
            </div>
        </div>
    );
};

export default NoCodeMessage;
