import React from "react";

//Icon
import googleAuth from "@assets/img/googleAuth.svg";

//Components
import Button from "@components/Button";

//Styles
import "./GoogleAuthSuccess.scss";

const GoogleAuthSuccess = ({ handleChange, removeOtp }) => {
    const onSubmit = (e) => {
        handleChange(e);
    };

    return (
        <div className="googleauth_success">
            <div className="googleauth_success__title">
                <img src={googleAuth} alt="googleauth" />
                <span>Google Authenticator</span>
            </div>
            <div className="googleauth_success__desc">
                <p>
                    Используется для ввода кода подтверждения Google при снятии
                    и изменении настроек безопасности
                </p>
            </div>
            <Button
                onClick={() => onSubmit(4)}
                className="googleauth_success__button_edit"
                theme="aftersubmit"
            >
                <svg
                    width="15"
                    height="15"
                    viewBox="0 0 15 15"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                >
                    <path
                        d="M11.0547 1.37891C11.7383 0.695312 12.8594 0.695312 13.543 1.37891L13.8711 1.70703C14.5547 2.39062 14.5547 3.51172 13.8711 4.19531L7.85547 10.2109C7.60938 10.457 7.30859 10.5938 7.00781 10.6758L4.51953 11.25C4.38281 11.2773 4.21875 11.25 4.10938 11.1406C4 11.0312 3.97266 10.8672 4 10.7305L4.57422 8.24219C4.65625 7.94141 4.79297 7.64062 5.03906 7.39453L11.0547 1.37891ZM12.9141 2.00781C12.5859 1.65234 12.0117 1.65234 11.6836 2.00781L10.9453 2.71875L12.5312 4.30469L13.2422 3.56641C13.5977 3.23828 13.5977 2.66406 13.2422 2.33594L12.9141 2.00781ZM5.42188 8.43359L5.01172 10.2383L6.78906 9.82812C6.95312 9.80078 7.11719 9.71875 7.22656 9.58203L11.9023 4.90625L10.3438 3.34766L5.66797 8.02344C5.53125 8.13281 5.44922 8.29688 5.42188 8.43359ZM6.1875 2.5C6.40625 2.5 6.625 2.71875 6.625 2.9375C6.625 3.18359 6.40625 3.375 6.1875 3.375H2.6875C1.94922 3.375 1.375 3.97656 1.375 4.6875V12.5625C1.375 13.3008 1.94922 13.875 2.6875 13.875H10.5625C11.2734 13.875 11.875 13.3008 11.875 12.5625V9.0625C11.875 8.84375 12.0664 8.625 12.3125 8.625C12.5312 8.625 12.75 8.84375 12.75 9.0625V12.5625C12.75 13.793 11.7656 14.75 10.5625 14.75H2.6875C1.45703 14.75 0.5 13.793 0.5 12.5625V4.6875C0.5 3.48438 1.45703 2.5 2.6875 2.5H6.1875Z"
                        fill="#09090E"
                    />
                </svg>

                <span>Редактировать</span>
            </Button>
            <Button
                onClick={removeOtp}
                className="googleauth_success__button_cancel"
                theme="red"
            >
                <svg
                    width="15"
                    height="15"
                    viewBox="0 0 15 15"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                >
                    <path
                        d="M0.5 7.75C0.5 3.89453 3.61719 0.75 7.5 0.75C11.3555 0.75 14.5 3.89453 14.5 7.75C14.5 11.6328 11.3555 14.75 7.5 14.75C3.61719 14.75 0.5 11.6328 0.5 7.75ZM5.28516 6.46484L6.57031 7.75L5.28516 9.03516C5.01172 9.30859 5.01172 9.71875 5.28516 9.96484C5.53125 10.2383 5.94141 10.2383 6.1875 9.96484L7.47266 8.67969L8.78516 9.96484C9.03125 10.2383 9.44141 10.2383 9.6875 9.96484C9.96094 9.71875 9.96094 9.30859 9.6875 9.03516L8.40234 7.75L9.6875 6.46484C9.96094 6.21875 9.96094 5.80859 9.6875 5.53516C9.44141 5.28906 9.03125 5.28906 8.78516 5.53516L7.47266 6.84766L6.1875 5.53516C5.94141 5.28906 5.53125 5.28906 5.28516 5.53516C5.01172 5.80859 5.01172 6.21875 5.28516 6.46484Z"
                        fill="#FDFDFE"
                    />
                </svg>

                <span>Отключить</span>
            </Button>
        </div>
    );
};

export default GoogleAuthSuccess;
